In [1]:
!conda list\grep pandas

usage: conda-script.py [-h] [-V] command ...
conda-script.py: error: argument command: invalid choice: 'list\\grep' (choose from 'clean', 'config', 'create', 'help', 'info', 'init', 'install', 'list', 'package', 'remove', 'uninstall', 'run', 'search', 'update', 'upgrade')

In [2]:
import pandas as pd

In [4]:
df=pd.read_csv('C:\\Pandas\\friend_list.csv')

In [6]:
df

   name   age        job
0   John   20    student
1  Jenny   30  developer
2  Nicke   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [7]:
df.head()

   name   age        job
0   John   20    student
1  Jenny   30  developer
2  Nicke   30    teacher
3  Julia   40    dentist
4  Brian   45     manage

In [8]:
df.head(2)

   name   age        job
0   John   20    student
1  Jenny   30  developer

In [9]:
df.tail()

   name   age        job
1  Jenny   30  developer
2  Nicke   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [10]:
df.tail(3)

   name   age      job
3  Julia   40  dentist
4  Brian   45   manage
5  Chris   25   intern

In [3]:
df=pd.read_csv('C:\\Pandas\\friend_list.txt')

In [4]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
df=pd.read_csv('C:\\Pandas\\friend_list_tab.txt')

In [7]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [9]:
df=pd.read_csv('C:\\Pandas\\friend_list_tab.txt', delimiter='\t')

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
df=pd.read_csv('C:\\Pandas\\friend_list_no_head.txt')

In [12]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [16]:
df=pd.read_csv('C:\\Pandas\\friend_list_no_head.csv',header=None)

In [17]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45     manage
5  Chris  25     intern

In [18]:
df.columns=['name','age','job']

In [19]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [20]:
df=pd.read_csv('C:\\Pandas\\friend_list_no_head.csv',header=None, names=['name','age','job'])

In [21]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [ ]:
df